sslivins/bala2fire/sdkconfig.defaults
# M5Stack Fire / Bala2 Fire defaults
CONFIG_IDF_TARGET="esp32"

# 16 MB flash
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="16MB"

# 4 MB PSRAM
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_QUAD=y
CONFIG_SPIRAM_TYPE_AUTO=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_USE_MALLOC=y

# Higher CPU clock for balancing loop
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ=240

# C++ exceptions off (M5Unified uses RTTI but not exceptions)
CONFIG_COMPILER_CXX_RTTI=y

# 1 kHz FreeRTOS tick so the 200 Hz balancer loop has 5 ms resolution.
# (Default is 100 Hz, which rounds pdMS_TO_TICKS(5) to 0 ticks.)
CONFIG_FREERTOS_HZ=1000

# Angle PID direction: tested on-hardware. The default direction had
# wheels driving INTO the fall; flipping to POS=y was previously logged
# as the fix, but on the current bot the wheels still spin backward
# during balance. Flip back to negative direction.
# CONFIG_BALANCER_ANGLE_DIR_POS is not set

# Bumped balance gains toward the reference impl. The Kconfig defaults
# are intentionally conservative (kp=15, kd=60, PWM=400) and the bot
# couldn't catch its own fall. Reference values: kp=24, kd=90, PWM=1023.
# Going to kp=24, kd=90, PWM=800 — full reference gains with some PWM
# headroom retained for safety.
CONFIG_BALANCER_PWM_LIMIT=800
CONFIG_BALANCER_ANGLE_KP_MILLI=24000
CONFIG_BALANCER_ANGLE_KD_MILLI=90000

# OTA partition layout (two ~3 MB app slots + 10 MB FAT) so we can flash
# new firmware over Wi-Fi via components/bala2_ota.
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_FILENAME="partitions.csv"

# Enable rollback so a broken OTA reboots into the previous slot.
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y

# OTA streams a ~1 MB POST body; allow generous HTTP recv timeouts and
# a slightly bigger HTTP server stack.
CONFIG_HTTPD_MAX_REQ_HDR_LEN=1024
CONFIG_HTTPD_MAX_URI_LEN=512
